БухЭксп/Catalogs/CW_Пункты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Пункты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Пункты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма); 
	
	Если ПустаяСтрока(АдресПредставление) Тогда
		АдресПредставление = "Выбрать адрес пункта";
	КонецЕсли;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	АдресПредставление		= ТекущийОбъект.Адрес;
	КонтактнаяИнформация	= ТекущийОбъект.КонтактнаяИнформация;    
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Адрес					= АдресПредставление;
	ТекущийОбъект.КонтактнаяИнформация 	= КонтактнаяИнформация;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВводаАдреса = 
		УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации"), 
		КонтактнаяИнформация);
	
	Оповещение = Новый ОписаниеОповещения("ВводАдреса_Завершение", ЭтотОбъект);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыВводаАдреса, ЭтаФорма, Оповещение);
	
КонецПроцедуры


&НаКлиенте
Процедура ВводАдреса_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВводАдреса_ЗавершениеНаСеврере(Результат);
	
	Модифицированность = Истина;

КонецПроцедуры   

&НаСервере
Процедура ВводАдреса_ЗавершениеНаСеврере(Результат)
	
	АдресПредставление		= Результат.Представление;
	КонтактнаяИнформация	= Результат.КонтактнаяИнформация; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНаКартеАдрес(Команда)     
	
	УправлениеКонтактнойИнформациейКлиентБП.ПоказатьНаКартеНажатие(ЭтотОбъект, Элементы.ПоказатьНаКартеАдрес, Объект.Адрес);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьНаКартеКоординаты(Команда)     
	
	ПоказатьНаКартеКоординатыНажатие(ЭтотОбъект, Элементы.ПоказатьНаКартеКоординаты, Объект.Широта, Объект.Долгота);
	
КонецПроцедуры   

&НаКлиенте
Функция ИмяОбъектаФормы(Форма)
	
	Перем ИмяОбъекта, ИмяФормыПоСловам;
	
	ИмяФормыПоСловам = СтрРазделить(Форма.ИмяФормы, ".");
	
	Пока ИмяФормыПоСловам.ВГраница() > 1 Цикл
		ИмяФормыПоСловам.Удалить(ИмяФормыПоСловам.ВГраница());
	КонецЦикла;
	
	Возврат СтрСоединить(ИмяФормыПоСловам, ".");

КонецФункции

&НаКлиенте
Процедура ПоказатьНаКартеКоординатыНажатие(Форма, Элемент,  Знач Широта, Знач Долгота) 
	
	СписокСервисовКартографии = Новый СписокЗначений;
	СписокСервисовКартографии.Добавить("ЯндексКарты", "Яндекс.Карты",, БиблиотекаКартинок.ЯндексКарты);
	СписокСервисовКартографии.Добавить("GoogleMaps",  "Google Карты",, БиблиотекаКартинок.GoogleMaps);
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("Широта",  Широта);
	ПараметрыОповещения.Вставить("Долгота", Долгота);
	ПараметрыОповещения.Вставить("Объект",  ИмяОбъектаФормы(Форма));
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьКоординатыНаКартеНажатиеЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	Форма.ПоказатьВыборИзМеню(Оповещение, СписокСервисовКартографии, Элемент);

КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьКоординатыНаКартеНажатиеЗавершение(ИмяКартографическогоСервиса, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(ИмяКартографическогоСервиса) = Тип("ЭлементСпискаЗначений") 
		И ДополнительныеПараметры.Свойство("Широта") И ДополнительныеПараметры.Свойство("Долгота") Тогда
		
		ПоказатьКоординатыНаКарте(
			ДополнительныеПараметры.Широта,
			ДополнительныеПараметры.Долгота,
			ИмяКартографическогоСервиса.Значение);
		
		Комментарий = СтрШаблон(
			НСтр("ru = 'Объект: %1 Сервис: %2'"),
			ДополнительныеПараметры.Объект,
			ИмяКартографическогоСервиса.Представление);
			
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			НСтр("ru = 'Переход на карту'"),
			"Информация", Комментарий,
			,
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры    

// Показывает адрес в браузере на картах Яндекс или Google.
//
// Параметры:
//  Адрес                       - Строка - текстовое представление адреса.
//  ИмяКартографическогоСервиса - Строка - имя картографического сервиса, в котором необходимо показать адрес:
//                                         Яндекс.Карты или GoogleMaps.
//
&НаКлиенте
Процедура ПоказатьКоординатыНаКарте(Широта, Долгота, ИмяКартографическогоСервиса) 
	КоординатыКодированные = ДекодированиеКоординат(ИмяКартографическогоСервиса, Широта, Долгота);
	Если ИмяКартографическогоСервиса = "GoogleMaps" Тогда
		СтрокаЗапуска = "https://maps.google.com/maps?q=" + КоординатыКодированные;
	Иначе
		СтрокаЗапуска = "https://yandex.ru/maps/?pt=" + КоординатыКодированные;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаЗапуска);
	
КонецПроцедуры   

&НаКлиенте
Функция ДекодированиеКоординат(ИмяКартографическогоСервиса, Широта, Долгота)  
	
	//https://maps.google.com/maps?q=60.000375,30.238613&ll=60.000375,30.238613&z=17 
	//https://yandex.ru/maps/?pt=30.238613,60.000375&z=18&l=map
	Если ИмяКартографическогоСервиса = "GoogleMaps" Тогда
		Возврат СокрЛП(Широта)+","+СокрЛП(Долгота)+"&ll="+СокрЛП(Широта)+","+СокрЛП(Долгота)+"&z=17";	
	Иначе
		Возврат СокрЛП(Долгота)+","+СокрЛП(Широта) +"&z=18&l=map";	
	КонецЕсли
	                       
КонецФункции
   

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
